## PANDAS SERİSİ OLUŞTURMAK

In [1]:
import pandas as pd

In [3]:
pd.Series([10,88,3,4,5])

0    10
1    88
2     3
3     4
4     5
dtype: int64

#### pandas değerleri indekslerle birlikte tutar

In [4]:
seri = pd.Series([10,88,3,4,5])

In [6]:
type(seri)

pandas.core.series.Series

In [9]:
seri.axes      # indeks bilgisine erişiriz 1 den 5 e kadar(5 dahil değil.)

[RangeIndex(start=0, stop=5, step=1)]

In [11]:
seri.size # eleman sayısı

5

In [12]:
seri.ndim     # boyutu

1

In [15]:
seri.values          #sadece değerlere erişiriz indesk olmadan

array([10, 88,  3,  4,  5], dtype=int64)

In [17]:
seri.head(3)   #3 gözlem getirir.

0    10
1    88
2     3
dtype: int64

In [19]:
seri.tail(3)      #sondan 3 gözlem getirir.

2    3
3    4
4    5
dtype: int64

## index isimlendirmesi

In [20]:
pd.Series([99,22,332,94,5])

0     99
1     22
2    332
3     94
4      5
dtype: int64

In [23]:
pd.Series([99,22,332,94,5],index = [1,3,5,7,9]) # index no larını kendimiz belirledik.

1     99
3     22
5    332
7     94
9      5
dtype: int64

In [25]:
seri = pd.Series([99,22,332,94,5],index = ["a","b","c","d","e"])

In [26]:
seri["a"]

99

In [29]:
seri["a":"c"]    # slice,aralık, seçim işlemi de yapabiliriz.a dan c ye kadar git.

a     99
b     22
c    332
dtype: int64

## sözlük üzerinden liste oluşturmak

In [32]:
sozluk = {"reg":10,"log":11,"cart":12}

In [34]:
seri = pd.Series(sozluk)
seri

reg     10
log     11
cart    12
dtype: int64

## iki seriyi birleştirerek seri oluşturma

In [36]:
pd.concat([seri,seri])

reg     10
log     11
cart    12
reg     10
log     11
cart    12
dtype: int64

## ELEMAN İŞLEMLERİ

In [37]:
import numpy as np

In [40]:
a = np.array([1,2,33,444,75])
seri = pd.Series(a)  # farklı veri yapılarını pandas serisine dönüştürebiliriz.
seri

0      1
1      2
2     33
3    444
4     75
dtype: int32

In [41]:
seri[0]

1

In [43]:
seri[0:3] # 3 e kadar

0     1
1     2
2    33
dtype: int32

In [44]:
seri = pd.Series([121,200,150,99],
                index = ["reg","loj","cart","rf"])
seri

reg     121
loj     200
cart    150
rf       99
dtype: int64

In [46]:
seri.index   # index içeriği

Index(['reg', 'loj', 'cart', 'rf'], dtype='object')

In [47]:
seri.keys # key değerleri bilgileri

<bound method Series.keys of reg     121
loj     200
cart    150
rf       99
dtype: int64>

In [56]:
list(seri.items()) #serinin karşılık gelen değerlerin key value şeklinde gösterir.

[('reg', 121), ('loj', 200), ('cart', 150), ('rf', 99)]

In [51]:
seri.values  # sadecce değerler

array([121, 200, 150,  99], dtype=int64)

In [52]:
"reg" in seri   #reg serinin içinde mi

True

In [55]:
"a" in seri    # a serinin içinde mi

False

In [54]:
seri["reg"]

121

## fancy eleman

In [57]:
seri[["rf","reg"]]

rf      99
reg    121
dtype: int64

In [58]:
seri["reg"]=130

In [59]:
seri["reg"]

130

In [60]:
seri["reg":"loj"]

reg    130
loj    200
dtype: int64

#  PANDAS DATAFRAME OLUŞTURMA

In [1]:
import pandas as pd

In [2]:
l = [1,2,39,67,90]

In [3]:
l

[1, 2, 39, 67, 90]

In [4]:
pd.DataFrame(l, columns =["degisken_ismi"])

   degisken_ismi
0              1
1              2
2             39
3             67
4             90

In [5]:
import numpy as np

In [10]:
m = np.arange(1,10).reshape((3,3))
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [11]:
pd.DataFrame(m, columns =["var1","var2","var3"]) #değişkenleri de isimlendirdik.

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [12]:
# df isimlendirme

In [40]:
df = pd.DataFrame(m, columns =["var1","var2","var3"])
df.head()  # pandas serileri üzerinde ilk(baştan) gözlemleri gösterir.

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [20]:
df.columns #değişken isimlerini getirir.

Index(['deg1', 'deg2', 'deg3'], dtype='object')

In [19]:
df.columns = ("deg1","deg2","deg3")  #değişken isimlerini değiştirebiliriz.

In [18]:
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [22]:
type(df)  #pandas dataframe olduğunu görürüz.

pandas.core.frame.DataFrame

In [24]:
df.axes # satır ve sütun bilgisini verir.

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg1', 'deg2', 'deg3'], dtype='object')]

In [30]:
df.shape #boyut bilgisi(satır x sütun)

(3, 3)

In [27]:
df.ndim  #boyut

2

In [28]:
df.size  # eleman sayısı

9

In [36]:
df.values #dataframe tipindeki veri yapısından değerleri çeker.

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [37]:
type(df.values) #numpy arrayine çevirir.

numpy.ndarray

In [43]:
df.tail(1)      #son kısmı gösterir.

   var1  var2  var3
2     7     8     9

In [47]:
df.head(1)   #baş kısmı gösterir.

   var1  var2  var3
0     1     2     3

In [48]:
df.head(2)

   var1  var2  var3
0     1     2     3
1     4     5     6

In [49]:
a = np.array((1,2,3,4,5))

In [50]:
pd.DataFrame(a,columns=["deg1"])

   deg1
0     1
1     2
2     3
3     4
4     5

## ELEMAN İŞLEMLERİ

In [52]:
import numpy as np

In [53]:
s1=np.random.randint(10,size=5)
s2=np.random.randint(10,size=5)
s3=np.random.randint(10,size=5)

In [54]:
sozluk = {"var1":s1,"var2":s2,"var3":s3}
sozluk

{'var1': array([5, 1, 1, 7, 8]),
 'var2': array([4, 1, 1, 7, 7]),
 'var3': array([8, 7, 5, 1, 5])}

In [57]:
df = pd.DataFrame(sozluk)  #sözlük üzerinden dataframe oluşturduk.
df

   var1  var2  var3
0     5     4     8
1     1     1     7
2     1     1     5
3     7     7     1
4     8     7     5

In [59]:
df[0:1] #1 dahil değil.

   var1  var2  var3
0     5     4     8

In [60]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [62]:
df.index = ["a","b","c","d","e"]
df

   var1  var2  var3
a     5     4     8
b     1     1     7
c     1     1     5
d     7     7     1
e     8     7     5

In [64]:
df["c":"e"] # c den e ye kadar gider.

   var1  var2  var3
c     1     1     5
d     7     7     1
e     8     7     5

In [65]:
# SİLME

In [72]:
df.drop("a",axis =0)  #a yı sildik.
df
#veri setinin ana yapısı üzerinde değişiklik olmadı a yı silmedi tamamen eşitlemediğim için .

   var1  var2  var3
a     5     4     8
b     1     1     7
c     1     1     5
d     7     7     1
e     8     7     5

In [77]:
df.drop("b",axis =0, inplace = True) # true yaparsak kalıcı olarak siler.
df       #inplace kalıcı olmasını sağlar.
# axis satır ve sütunu belli eder.

   var1  var2  var3
c     1     1     5
d     7     7     1
e     8     7     5

In [79]:
# fancy

In [80]:
l = ["c","e"]

In [82]:
df.drop(l,axis = 0)     #sadece c ve e yi sildik.temelli olmadı

   var1  var2  var3
d     7     7     1

In [84]:
# DEĞİŞKENLER İÇİN

In [86]:
df

   var1  var2  var3
c     1     1     5
d     7     7     1
e     8     7     5

In [87]:
"var1" in df

True

In [88]:
l = ["var1","var4","var2"]

In [91]:
for i in l:
    print(i in df)  # değişken var mı diye baktık.

True
False
True

In [92]:
df

   var1  var2  var3
c     1     1     5
d     7     7     1
e     8     7     5

In [95]:
df["var1"]  #değişkene erişmiş olduk.

c    1
d    7
e    8
Name: var1, dtype: int32

In [98]:
df["var4"] = df["var1"]  / df["var2"]  
# var4 diye bis sütun,değişken ekledik var1 in var2 ye bölünmesine eşitledik. 
#köşeli parantez olduğunda erişim olduğunu  anlıyor python

In [97]:
df

   var1  var2  var3      var4
c     1     1     5  1.000000
d     7     7     1  1.000000
e     8     7     5  1.142857

In [99]:
# DEĞİŞKEN SİLMEK

In [100]:
df.drop("var4",axis = 1)

   var1  var2  var3
c     1     1     5
d     7     7     1
e     8     7     5

In [101]:
df

   var1  var2  var3      var4
c     1     1     5  1.000000
d     7     7     1  1.000000
e     8     7     5  1.142857

In [102]:
df.drop("var4",axis = 1,inplace = True)

In [103]:
df

   var1  var2  var3
c     1     1     5
d     7     7     1
e     8     7     5

In [104]:
# FANCY İLE SİLME

In [107]:
l = ["var1","var2"]

In [110]:
df.drop(l,axis = 1 )    # var1 ve var2 değişkenlerini sildik.kalıcı değil.

   var3
c     5
d     1
e     5

# GÖZLEM VE DEĞİŞKEN SEÇİMİ : loc & iloc

In [111]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30,size=(10,3))
df = pd.DataFrame(m,columns =["var1","var2","var3"])
df

   var1  var2  var3
0    13    29    27
1    29    14    27
2     3     5     8
3     8    11     4
4    29    18     1
5    25    18    25
6    16    12     6
7    15    19     4
8    10    27    16
9    20    20    27

In [112]:
# loc: tanımlandığı şekli ile seçim yapmak için kullnılır.

In [116]:
df.loc[0:3]     # normale 3 dahil olmaz ama loc da dahil oluyor.

   var1  var2  var3
0    13    29    27
1    29    14    27
2     3     5     8
3     8    11     4

In [117]:
# iloc: alışık olduğumuz indeksleme mantığıyla seçim yapar.

In [118]:
df.iloc[0:3]    # normalde old. gibi 3 dahil olmadan getirir.

   var1  var2  var3
0    13    29    27
1    29    14    27
2     3     5     8

In [120]:
df.iloc[0,0]

13

In [128]:
df

   var1  var2  var3
0    13    29    27
1    29    14    27
2     3     5     8
3     8    11     4
4    29    18     1
5    25    18    25
6    16    12     6
7    15    19     4
8    10    27    16
9    20    20    27

In [129]:
df.iloc[:3,:2]

   var1  var2
0    13    29
1    29    14
2     3     5

In [130]:
df.loc[0:3,"var3"] #iloc da var3 şeklinde hata alırız kullanılmaz.

0    27
1    27
2     8
3     4
Name: var3, dtype: int32

In [131]:
#   df.iloc[0:3,"var3"]    iloc da var3 şeklinde hata alırız kullanılmaz.

In [133]:
df.iloc[0:3]["var3"]  # tek bir değişken için tekrar köşeli parantez giriyoruz.

0    27
1    27
2     8
Name: var3, dtype: int32

# KOŞULLU ELEMAN İŞLEMLERi

In [134]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30,size=(10,3))
df = pd.DataFrame(m,columns =["var1","var2","var3"])
df

   var1  var2  var3
0     4    14    11
1    25    12    22
2    18    29     8
3     3    12    16
4     1     9    28
5     5     4    27
6    29    16    29
7    24     3    28
8    13     7    14
9    15    25    11

In [135]:
df["var1"]

0     4
1    25
2    18
3     3
4     1
5     5
6    29
7    24
8    13
9    15
Name: var1, dtype: int32

In [136]:
df["var1"][0:2]

0     4
1    25
Name: var1, dtype: int32

In [137]:
df[0:2]

   var1  var2  var3
0     4    14    11
1    25    12    22

In [139]:
df[0:2]["var1"] #içine ikinci bir değişken giremiyoruz.bunu fanc ile yapabiliriz.
# df[0:2][["var1","var2"]] bir tane daha köşeli parantez ekliyoruz.

0     4
1    25
Name: var1, dtype: int32

In [140]:
df

   var1  var2  var3
0     4    14    11
1    25    12    22
2    18    29     8
3     3    12    16
4     1     9    28
5     5     4    27
6    29    16    29
7    24     3    28
8    13     7    14
9    15    25    11

In [141]:
df.var1

0     4
1    25
2    18
3     3
4     1
5     5
6    29
7    24
8    13
9    15
Name: var1, dtype: int32

In [143]:
df[df.var1 > 15]

   var1  var2  var3
1    25    12    22
2    18    29     8
6    29    16    29
7    24     3    28

In [148]:
df[df.var1 > 15][["var1","var2"]]   # fancy iki değişken

   var1  var2
1    25    12
2    18    29
6    29    16
7    24     3

In [149]:
df[df.var1 > 15]["var1"]

1    25
2    18
6    29
7    24
Name: var1, dtype: int32

In [154]:
df[(df.var1 > 15) & (df.var3 < 20)]   # iki koşul

   var1  var2  var3
2    18    29     8

In [156]:
#  df[(df.var1 > 15) , ["var1","var2"]]  koşulla değişken bilgisi girmek için loc ekleriz.yoksa hata alırız.
df.loc[(df.var1 > 15) , ["var1","var2"]]
#  ya da iki köşeli parantez kullanırız. df[(df.var1 > 15)[["var1","var2"]]

   var1  var2
1    25    12
2    18    29
6    29    16
7    24     3

# BİRLEŞTİRME (JOİN) İŞLEMLERİ

In [161]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30,size=(5,3))
df1 = pd.DataFrame(m,columns =["var1","var2","var3"])
df1

   var1  var2  var3
0    21    20     5
1    14    18     1
2    24    11     3
3    15    16    17
4     4    21     5

In [162]:
df2 = df1 + 99 
df2

   var1  var2  var3
0   120   119   104
1   113   117   100
2   123   110   102
3   114   115   116
4   103   120   104

In [164]:
pd.concat([df1,df2])     #birleştirdik indeksler yanlış oldu.

   var1  var2  var3
0    21    20     5
1    14    18     1
2    24    11     3
3    15    16    17
4     4    21     5
0   120   119   104
1   113   117   100
2   123   110   102
3   114   115   116
4   103   120   104

In [167]:
?pd.concat

Signature:
pd.concat(
    objs: 'Iterable[NDFrame] | Mapping[HashableT, NDFrame]',
    *,
    axis: 'Axis' = 0,
    join: 'str' = 'outer',
    ignore_index: 'bool' = False,
    keys=None,
    levels=None,
    names=None,
    verify_integrity: 'bool' = False,
    sort: 'bool' = False,
    copy: 'bool | None' = None,
) -> 'DataFrame | Series'
Docstring:
Concatenate pandas objects along a particular axis.

Allows optional set logic along the other axes.

Can also add a layer of hierarchical indexing on the concatenation axis,
which may be useful if the labels are the same (or overlapping) on
the passed axis number.

Parameters
----------
objs : a sequence or mapping of Series or DataFrame objects
    If a mapping is passed, the sorted keys will be used as the `keys`
    argument, unless it is passed, in which case the values will be
    selected (see below). Any None objects will be dropped silently unless
    they are all None in which case a ValueError will be raised.
axis : {0/'index', 1/'columns'}, default 0
    The axis to concatenate along.
join : {'inner', 'outer'}, default 'outer'
    How to handle indexes on other axis (or axes).
ignore_index : bool, default False
    If True, do not use the index values along the concatenation axis. The
    resulting axis will be labeled 0, ..., n - 1. This is useful if you are
    concatenating objects where the concatenation axis does not have
    meaningful indexing information. Note the index values on the other
    axes are still respected in the join.
keys : sequence, default None
    If multiple levels passed, should contain tuples. Construct
    hierarchical index using the passed keys as the outermost level.
levels : list of sequences, default None
    Specific levels (unique values) to use for constructing a
    MultiIndex. Otherwise they will be inferred from the keys.
names : list, default None
    Names for the levels in the resulting hierarchical index.
verify_integrity : bool, default False
    Check whether the new concatenated axis contains duplicates. This can
    be very expensive relative to the actual data concatenation.
sort : bool, default False
    Sort non-concatenation axis if it is not already aligned.

copy : bool, default True
    If False, do not copy data unnecessarily.

Returns
-------
object, type of objs
    When concatenating all ``Series`` along the index (axis=0), a
    ``Series`` is returned. When ``objs`` contains at least one
    ``DataFrame``, a ``DataFrame`` is returned. When concatenating along
    the columns (axis=1), a ``DataFrame`` is returned.

See Also
--------
DataFrame.join : Join DataFrames using indexes.
DataFrame.merge : Merge DataFrames by indexes or columns.

Notes
-----
The keys, levels, and names arguments are all optional.

A walkthrough of how this method fits in with other tools for combining
pandas objects can be found `here
<https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html>`__.

It is not recommended to build DataFrames by adding single rows in a
for loop. Build a list of rows and make a DataFrame in a single concat.

Examples
--------
Combine two ``Series``.

>>> s1 = pd.Series(['a', 'b'])
>>> s2 = pd.Series(['c', 'd'])
>>> pd.concat([s1, s2])
0    a
1    b
0    c
1    d
dtype: object

Clear the existing index and reset it in the result
by setting the ``ignore_index`` option to ``True``.

>>> pd.concat([s1, s2], ignore_index=True)
0    a
1    b
2    c
3    d
dtype: object

Add a hierarchical index at the outermost level of
the data with the ``keys`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'])
s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

Label the index keys you create with the ``names`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'],
...           names=['Series name', 'Row ID'])
Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

Combine two ``DataFrame`` objects with identical columns.

>>> df1 = pd.DataFrame([['a', 1], ['b', 2]],
...                    columns=['letter', 'number'])
>>> df1
  letter  number
0      a       1
1      b       2
>>> df2 = pd.DataFrame([['c', 3], ['d', 4]],
...                    columns=['letter', 'number'])
>>> df2
  letter  number
0      c       3
1      d       4
>>> pd.concat([df1, df2])
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects with overlapping columns
and return everything. Columns outside the intersection will
be filled with ``NaN`` values.

>>> df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
...                    columns=['letter', 'number', 'animal'])
>>> df3
  letter  number animal
0      c       3    cat
1      d       4    dog
>>> pd.concat([df1, df3], sort=False)
  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

Combine ``DataFrame`` objects with overlapping columns
and return only those that are shared by passing ``inner`` to
the ``join`` keyword argument.

>>> pd.concat([df1, df3], join="inner")
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects horizontally along the x axis by
passing in ``axis=1``.

>>> df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
...                    columns=['animal', 'name'])
>>> pd.concat([df1, df4], axis=1)
  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

Prevent the result from including duplicate index values with the
``verify_integrity`` option.

>>> df5 = pd.DataFrame([1], index=['a'])
>>> df5
   0
a  1
>>> df6 = pd.DataFrame([2], index=['a'])
>>> df6
   0
a  2
>>> pd.concat([df5, df6], verify_integrity=True)
Traceback (most recent call last):
    ...
ValueError: Indexes have overlapping values: ['a']

Append a single row to the end of a ``DataFrame`` object.

>>> df7 = pd.DataFrame({'a': 1, 'b': 2}, index=[0])
>>> df7
    a   b
0   1   2
>>> new_row = pd.Series({'a': 3, 'b': 4})
>>> new_row
a    3
b    4
dtype: int64
>>> pd.concat([df7, new_row.to_frame().T], ignore_index=True)
    a   b
0   1   2
1   3   4
File:      c:\users\msi\anaconda3\lib\site-packages\pandas\core\reshape\concat.py
Type:      function

In [172]:
pd.concat([df1,df2], ignore_index = True)    # indeksleri düzenledik.sıfırlanmış sıfırndan indeks oldu.

   var1  var2  var3
0    21    20     5
1    14    18     1
2    24    11     3
3    15    16    17
4     4    21     5
5   120   119   104
6   113   117   100
7   123   110   102
8   114   115   116
9   103   120   104

In [173]:
df1.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [176]:
df2.columns = ["var1","var2","deg3"]

In [177]:
df2

   var1  var2  deg3
0   120   119   104
1   113   117   100
2   123   110   102
3   114   115   116
4   103   120   104

In [178]:
df1

   var1  var2  var3
0    21    20     5
1    14    18     1
2    24    11     3
3    15    16    17
4     4    21     5

In [180]:
pd.concat([df1,df2])  #değişkenler uyuşmadı

   var1  var2  var3   deg3
0    21    20   5.0    NaN
1    14    18   1.0    NaN
2    24    11   3.0    NaN
3    15    16  17.0    NaN
4     4    21   5.0    NaN
0   120   119   NaN  104.0
1   113   117   NaN  100.0
2   123   110   NaN  102.0
3   114   115   NaN  116.0
4   103   120   NaN  104.0

In [192]:
pd.concat([df1,df2], join = "inner" )   # kesişimlerine göre birleştirdi.

   var1  var2
0    21    20
1    14    18
2    24    11
3    15    16
4     4    21
0   120   119
1   113   117
2   123   110
3   114   115
4   103   120

In [193]:
pd.concat([df1, df2.reindex(columns = df1.columns)], ignore_index = True) 
# hepsini birleştirir.df1 e göre.birleştirme işlemini yapayım ama birine göre burda df1 e göre yaptık.

   var1  var2  var3
0    21    20   5.0
1    14    18   1.0
2    24    11   3.0
3    15    16  17.0
4     4    21   5.0
5   120   119   NaN
6   113   117   NaN
7   123   110   NaN
8   114   115   NaN
9   103   120   NaN

# İLERİ BİREŞTİRME İŞLEMLERİ

In [194]:
# BİREBİR BİRLEŞTRİME

In [196]:
df1 = pd.DataFrame({'calisanlar':['ali','veli','ayse','fatma',],
                   'grup':['muhasebe','mühendislik','mühendislik','ik']})
df1

  calisanlar         grup
0        ali     muhasebe
1       veli  mühendislik
2       ayse  mühendislik
3      fatma           ik

In [197]:
df2 = pd.DataFrame({'calisanlar':['ali','veli','ayse','fatma',],
                   'ilk_giris':[2010,2009,2014,2019]})
df2

  calisanlar  ilk_giris
0        ali       2010
1       veli       2009
2       ayse       2014
3      fatma       2019

In [201]:
pd.merge(df1,df2)     # birebir birleştirme yaptık.ikisinde de calisanlar old. için ona göre birleştirdi.bunu belirtedebilriz araşğıdaki gibi.

  calisanlar         grup  ilk_giris
0        ali     muhasebe       2010
1       veli  mühendislik       2009
2       ayse  mühendislik       2014
3      fatma           ik       2019

In [203]:
pd.merge(df1,df2, on = 'calisanlar') #bunu belirtedebiliriz.

  calisanlar         grup  ilk_giris
0        ali     muhasebe       2010
1       veli  mühendislik       2009
2       ayse  mühendislik       2014
3      fatma           ik       2019

In [204]:
# ÇOKTAN TEKE

In [223]:
df3 = pd.merge(df1,df2)

In [224]:
df3

  calisanlar         grup  ilk_giris
0        ali     muhasebe       2010
1       veli  mühendislik       2009
2       ayse  mühendislik       2014
3      fatma           ik       2019

In [231]:
df4 = pd.DataFrame({'grup' :['muhasebe','mühendislik','ik'],
                   'mudur':['caner','mustafa','berkcan']})
df4

          grup    mudur
0     muhasebe    caner
1  mühendislik  mustafa
2           ik  berkcan

In [232]:
df3

  calisanlar         grup  ilk_giris
0        ali     muhasebe       2010
1       veli  mühendislik       2009
2       ayse  mühendislik       2014
3      fatma           ik       2019

In [233]:
df4

          grup    mudur
0     muhasebe    caner
1  mühendislik  mustafa
2           ik  berkcan

In [234]:
pd.merge(df3,df4)

  calisanlar         grup  ilk_giris    mudur
0        ali     muhasebe       2010    caner
1       veli  mühendislik       2009  mustafa
2       ayse  mühendislik       2014  mustafa
3      fatma           ik       2019  berkcan

In [235]:
# ÇOKTAN ÇOKA

In [236]:
df5 = pd.DataFrame({'grup':['muhasebe','muhasebe','mühendislik','mühendislik','ik','ik'],
                   'yetenekler':['matematik','excel','kodlama','linux','excel','yonetim']})
df5

          grup yetenekler
0     muhasebe  matematik
1     muhasebe      excel
2  mühendislik    kodlama
3  mühendislik      linux
4           ik      excel
5           ik    yonetim

In [237]:
df1

  calisanlar         grup
0        ali     muhasebe
1       veli  mühendislik
2       ayse  mühendislik
3      fatma           ik

In [239]:
pd.merge(df1,df5)      # her çalışanın yetenekleri

  calisanlar         grup yetenekler
0        ali     muhasebe  matematik
1        ali     muhasebe      excel
2       veli  mühendislik    kodlama
3       veli  mühendislik      linux
4       ayse  mühendislik    kodlama
5       ayse  mühendislik      linux
6      fatma           ik      excel
7      fatma           ik    yonetim

# TOPLULAŞTIRMA VE GRUPLAMA (AGGREGATİON & GROUPİNG)

# basit toplulaştırma fonksiyonları:
* count()
* first()
* last()
* mean()
* median()
* min(),max()
* std()
* var()
* sum()

In [292]:
import seaborn as sns

In [242]:
?sns.load_dataset

Signature: sns.load_dataset(name, cache=True, data_home=None, **kws)
Docstring:
Load an example dataset from the online repository (requires internet).

This function provides quick access to a small number of example datasets
that are useful for documenting seaborn or generating reproducible examples
for bug reports. It is not necessary for normal usage.

Note that some of the datasets have a small amount of preprocessing applied
to define a proper ordering for categorical variables.

Use :func:`get_dataset_names` to see a list of available datasets.

Parameters
----------
name : str
    Name of the dataset (``{name}.csv`` on
    https://github.com/mwaskom/seaborn-data).
cache : boolean, optional
    If True, try to load from the local cache first, and save to the cache
    if a download is required.
data_home : string, optional
    The directory in which to cache data; see :func:`get_data_home`.
kws : keys and values, optional
    Additional keyword arguments are passed to passed through to
    :func:`pandas.read_csv`.

Returns
-------
df : :class:`pandas.DataFrame`
    Tabular data, possibly with some preprocessing applied.
File:      c:\users\msi\anaconda3\lib\site-packages\seaborn\utils.py
Type:      function

In [278]:
df = sns.load_dataset("planets")
df.head()  # veri setini gözlemledik.

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [279]:
df.shape    #1035 gözlem 6 değişkenden oluşuyor.

(1035, 6)

In [280]:
df["mass"].mean()       #mass değişkeninin ortalamasını hesapladı.

2.6381605847953216

In [281]:
df["mass"].count()   #mass değişkeninin toplamları

513

In [282]:
df["mass"].min()

0.0036

In [283]:
df["mass"].max()

25.0

In [284]:
df["mass"].sum()

1353.37638

In [285]:
df["mass"].var()   #varyans

14.58183312700122

In [286]:
df["mass"].std()   #standart sapma hesaplar

3.8186166509616046

In [294]:
df.describe()  #veri seti içeriğinin betimsel istatistiğini görüntüleriz.tamamını

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [296]:
df.describe().T      #transpozunu tersini al demektir satır ve sütunlat yer değiştirir.

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [299]:
#  df.mean() bende çalışmadı ortalamaları getirir.

In [301]:
#eğer veri setinin içerisinde eksik değerler olursa yinede istatistiğe bakmak istiyorum diyor isek.
df.dropna().describe().T
#eksik gözlemleri sildi.bazı değerlerde değişiklik olduğu anlaşılır değiiklikler olur.

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

# GRUPLAMA İŞLEMLERİ

In [307]:
df = pd.DataFrame({'gruplar': ['a','b','c','a','b','c'],
                   'veri': [10,11,52,23,43,55]}, columns = ['gruplar','veri'])
df

  gruplar  veri
0       a    10
1       b    11
2       c    52
3       a    23
4       b    43
5       c    55

In [310]:
df.groupby("gruplar")    #bir obje oluştu.gruplayarak a b c yi tuttu.

In [313]:
df.groupby("gruplar").mean()       #gruplama ile aggregation fonk. birlikte kullanılır.

         veri
gruplar
a        16.5
b        27.0
c        53.5

In [314]:
df.groupby("gruplar").sum()

         veri
gruplar
a          33
b          54
c         107

In [317]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [319]:
df.groupby("method")  #yanına bir agregation fonksiyonu olmadan işlem yapmaz sadece tutar

In [327]:
df.groupby("method")["orbital_period"].mean()          #method:değişken,orbital:neye göre gruplanacağı,son olarak fonks.
#değişkeni de belirtmeliyiz bir sürü vsar çünkü verisetinde

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [325]:
df.groupby("method")["mass"].mean()

method
Astrometry                            NaN
Eclipse Timing Variations        5.125000
Imaging                               NaN
Microlensing                          NaN
Orbital Brightness Modulation         NaN
Pulsar Timing                         NaN
Pulsation Timing Variations           NaN
Radial Velocity                  2.630699
Transit                          1.470000
Transit Timing Variations             NaN
Name: mass, dtype: float64

In [330]:
df.groupby("method")["mass"].describe()
#dataframe içindeki method kategorik değişkeninin sınıflarını yakaladı bu sınıfların altında bu sayısal
#değişkenin her bir sınıf altındaki max vb değerlere erişmiş oldu.

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Eclipse Timing Variations,2.0,5.125000,1.308148,4.2000,4.66250,5.125,5.5875,6.05
Imaging,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Microlensing,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Orbital Brightness Modulation,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Pulsar Timing,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Pulsation Timing Variations,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Radial Velocity,510.0,2.630699,3.825883,0.0036,0.22525,1.260,3.0000,25.00
Transit,1.0,1.470000,NaN,1.4700,1.47000,1.470,1.4700,1.47
Transit Timing Variations,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN

# İLERİ TOPLULAŞTIRMA İŞLEMLERİ (Aggregate,filter,transform,apply)

In [331]:
import pandas as pd
df = pd.DataFrame({'gruplar':['a','b','c','a','b','c'],
                  'degisken1':[10,23,33,22,11,99],
                  'degisken2':[100,253,333,262,111,969]},
                 columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       a         10        100
1       b         23        253
2       c         33        333
3       a         22        262
4       b         11        111
5       c         99        969

In [332]:
# aggregate

In [338]:
df.groupby("gruplar").aggregate(["min",np.median,max]) #istediğimiz fonksiyonları aldık sadece.
#numpy içindekini tırnakla yazamayız.
#pandas içindekini tırnakla ya da tırnaksız yazabiliriz.(min,"min")ikiside çalışacaktır.

        degisken1            degisken2
              min median max       min median  max
gruplar
a              10   16.0  22       100  181.0  262
b              11   17.0  23       111  182.0  253
c              33   66.0  99       333  651.0  969

In [340]:
df.groupby("gruplar").aggregate({"degisken1":"min","degisken2":"max"}) 
# degisken1 için min  2 için max kullandık.

         degisken1  degisken2
gruplar
a               10        262
b               11        253
c               33        969

In [341]:
# filter

In [342]:
import pandas as pd
df = pd.DataFrame({'gruplar':['a','b','c','a','b','c'],
                  'degisken1':[10,23,33,22,11,99],
                  'degisken2':[100,253,333,262,111,969]},
                 columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       a         10        100
1       b         23        253
2       c         33        333
3       a         22        262
4       b         11        111
5       c         99        969

In [343]:
def filter_func(x):
    return x["degisken1"].std() > 9

In [346]:
df.groupby("gruplar").std()

         degisken1   degisken2
gruplar
a         8.485281  114.551299
b         8.485281  100.409163
c        46.669048  449.719913

In [348]:
df.groupby("gruplar").filter(filter_func)  
#karmaşık bir filtreleme amacını fonksiyon olarak tanımlayabilirsek o zaman kendin tanımla filter ile yap.

  gruplar  degisken1  degisken2
2       c         33        333
5       c         99        969

In [349]:
# transform

In [350]:
import pandas as pd
df = pd.DataFrame({'gruplar':['a','b','c','a','b','c'],
                  'degisken1':[10,23,33,22,11,99],
                  'degisken2':[100,253,333,262,111,969]},
                 columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       a         10        100
1       b         23        253
2       c         33        333
3       a         22        262
4       b         11        111
5       c         99        969

In [351]:
df["degisken1"]*9

0     90
1    207
2    297
3    198
4     99
5    891
Name: degisken1, dtype: int64

In [358]:
df_a =df.iloc[:,1:3]   #kategorik değişken aşağıda hata verdiği için onu çıkarttık.ve iloc yazdık.

In [368]:
df_a.transform(lambda x: (x-x.mean())/x.std())     
# x değişken
# tranform vektörel bir fonks.yani sütun bazında değişkenler bazında tüm değişkenler üzerinde işlem yapmak için kullanılan fonksiyon
# bu fonksiyonun özelliği bizim istediğimiz bir fonksiyonu değişkenlerin üzerinde çalıştırabilmek.
# bu sebeple lamda ile kendi tanımladığımız fonks gibi kullandık.
# bu fonk her bir değşkeni gezdiğinde yakalamış old. değişkenin her bir elemanından bu değişkenin ortalamasını çıkaracak. 
# yakalamış old. her değişkenin stamdart sapmasına böler.
# her bir elemanı gezer.değişkenler üzerinde kullanabiliriz.
#lambda isimsiz fonksiyon

   degisken1  degisken2
0  -0.687871  -0.738461
1  -0.299074  -0.263736
2   0.000000  -0.015514
3  -0.328982  -0.235811
4  -0.657963  -0.704331
5   1.973890   1.957853

In [383]:
# apply  :değişkenler üzerinde gezinebiliriz.fonk tanımlayabiliriz.toplulaştırma yapabiliriz.

In [371]:
import pandas as pd
df = pd.DataFrame({'gruplar':['a','b','c','a','b','c'],
                  'degisken1':[10,23,33,22,11,99],
                  'degisken2':[100,253,333,262,111,969]},
                 columns = ['degisken1','degisken2'])
df

   degisken1  degisken2
0         10        100
1         23        253
2         33        333
3         22        262
4         11        111
5         99        969

In [376]:
df.apply(np.sum)       #sütun bazında toplamı verdi.

degisken1     198
degisken2    2028
dtype: int64

In [378]:
df.apply(np.mean)  #bo fonksiyonları kullanabildiğimiz gibi kendi tanımladığımız fonkları da kullanabilirriz.

degisken1     33.0
degisken2    338.0
dtype: float64

In [379]:
import pandas as pd
df = pd.DataFrame({'gruplar':['a','b','c','a','b','c'],
                  'degisken1':[10,23,33,22,11,99],
                  'degisken2':[100,253,333,262,111,969]},
                 columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       a         10        100
1       b         23        253
2       c         33        333
3       a         22        262
4       b         11        111
5       c         99        969

In [381]:
df.groupby("gruplar").apply(np.sum)  #gruplayıp yaptık.

        gruplar  degisken1  degisken2
gruplar
a            aa         32        362
b            bb         34        364
c            cc        132       1302

# PİVOT TABLOLAR

In [384]:
import pandas as pd
import seaborn as sns 
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [385]:
titanic.groupby("sex")["survived"].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [387]:
titanic.groupby("sex")[["survived"]].mean()      #iki tane köşeli p. olursa dataframe gibi görünür.

        survived
sex
female  0.742038
male    0.188908

In [390]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean")
# x ekseninde cinsiyet ,y ekseninde class(fisrtclass vb.) a bölüp kesişimlerinde birşey ifade ettik.

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [392]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean").unstack() 
#unstack daha düzgün getirir.

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [393]:
# pivot ile table

In [395]:
titanic.pivot_table("survived",index ="sex",columns ="class")
#survived değişken.index satır ,class da sütun olarak değerlendiriliyor.

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [397]:
titanic.age.head()   #titanic de age değişkeninini gözlemledik.

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [398]:
age = pd.cut(titanic["age"],[0,18,90]) #age değişkenini böl bu aralıklarla.
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 90.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64, right]): [(0, 18] < (18, 90]]

In [401]:
titanic.pivot_table("survived",["sex",age],"class") 
#age i dışardan aldık kendimiz tanımlamıştık kesip.diğerlerini veri setinden aldığımız için tırnakla yazdık.

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663

# DIŞ KAYNAKLI VERİ OKUMAK

In [403]:
import pandas as pd

## CSV OKUMA

In [408]:
pd.read_csv("reading_data/ornekcsv.csv",sep = ";")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

## TXT OKUMA

In [411]:
pd.read_csv("reading_data/duz_metin.txt")     #boşluk ve virgül varsa okur sep belirtilmeden,virgül zaten sep in varsayılanı

    1 2
0   2 2
1   3 2
2   4 2
3   5 2
4   6 2
5  7 2
6   8 2
7   9 2
8  10 2

## EXCEL OKUMA

In [431]:
df =pd.read_excel("reading_data/ornekx.xlsx")

In [432]:
type(df)

pandas.core.frame.DataFrame

In [433]:
df.head()

    a    b    c
0  78   12  1.0
1  78   12  2.0
2  78  324  3.0
3   7    2  4.0
4  88   23  5.0

In [434]:
df

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [435]:
df.columns = ("A","B","C")

In [437]:
df

      A    B     C
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

## sıfırdan txt okuma

In [440]:
tips = pd.read_csv("reading_data/data.txt")

In [441]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4